---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.DesignCoolingLoad
source: html/379028ff-bc67-60b6-f1cf-41b303daa5f3.htm
---
# Autodesk.Revit.DB.Mechanical.Space.DesignCoolingLoad Property

Get or set the Design Cooling Load of the Space.

## Syntax (C#)
```csharp
public double DesignCoolingLoad { get; set; }
```

## Remarks
This property is used to get or set the Design Cooling Load of the Space.